<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "DTD/xhtml1-transitional.dtd"> 
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
 <meta http-equiv="content-type" content="text/html; charset=iso-8859-1" />
 <meta http-equiv="content-style-type" content="text/css" />
 <meta name="author" content="Arlsair" />
 <meta name="date" content="2003-07-09" />
 <title>AviSynth 2 - Version 2.5</title>
 <link rel="stylesheet" type="text/css" href="style.css" />
</head><body>
<span class="titresmall"><a name="Gettingstarted"></a>AviSynth 2.5</span><br /><br />
<br />
<b><u>Neue Video Features:</u></b>
<ul>
 <li>Eine neuer Farbraum wurde eingef&uuml;hrt: eingebaute YV12 Unterst&uuml;tzung. Es werden YV12 Quellen durch DirectShowSource, AVISource und diverse MPEG Dekoder unterst&uuml;tzt.<br />
     F&uuml;r eine Beschreibung der Farbr&auml;ume, die Avisynth verarbeiten kann, siehe <a href="filters/convert.html" target="main">hier</a>.</li>
</ul>
<br />
<b><u>Neue Audio Features:</u></b>
<ul>
 <li>Interne Unterst&uuml;tztung f&uuml;r Flie&szlig;komma Samplingtiefen. AviSynth hat nun eine interne Verarbeitung von Flie&szlig;komma Samplingtiefen.</li>
 <li>Eingebaute Unterst&uuml;tzung von 24 Bit Integer und 32 Bit Integer Samplingtiefen. Die Eingabe und Ausgabe von Samplingtiefen von h&ouml;herer Genauigkeit wird unterst&uuml;tzt.</li>
 <li>Mehrkanal Unterst&uuml;tzung. AviSynth unterst&uuml;tzt nun eine unbegrenzte Anzahl an Kan&auml;len bei der Eingabe und Ausgabe.</li>
 <li>Automatische Konvertierung der Samplingtiefe. Wenn ein Filter eine bestimmte Samplingtiefe nicht unterst&uuml;tzt, wird diese konvertiert in eine Samplingtiefe, die die Qualit&auml;t m&ouml;glichst erh&auml;lt (meisten dann Dezimalzahl). Dezimalzahl Samplingtiefen werden dann automatisch in 16 Bit zur&uuml;ckkonvertiert, bevor sie ausgeben werden.</li>
</ul>
<br />
<b><u>Neue interne Features:</u></b>
<ul>
 <li>Optmierungen. Viele grundlegende Features wurde optimiert und sind nun schneller als in den bisherigen Versionen.</li>
 <li>Bessere Ausnutzung des Caches. Filter k&ouml;nnnen nun Filters k&ouml;nnen nun dem Cache-Managment Hinweise geben, ob deren Quelle zwischengespeichert werden soll oder nicht, so dass der Arbeitsspeicher effizienter genutzt werden kann.</li>
</ul>
<br />
<b><u>Plugins:</u></b>
<ul>
 <li>Filter f&uuml;r AviSynth 1.0x und 2.0x funktionieren nicht mit 2.5. Sie werden in der Regel abst&uuml;rzen, wenn man es dennoch versucht. Es gibt eine &Uuml;berpr&uuml;fung, ob ein passendes Plugin geladen wird.</li>
 <li>Plugins m&uuml;ssen f&uuml;r AviSynth 2.5 neucompiliert werden !</li>
 <li>Plugins f&uuml;r AviSynth 2.5 k&ouml;nnen nat&uuml;rlich nicht mit alten AviSynth Versionen genutzt werden.</li>
 <li>Es gibt nun einen anderen Schl&uuml;ssel in der Registrierung f&uuml;r das Verzeichnis, in dem man die Dll`s f&uuml;rs automatische Laden von Plugins ablegen kann.</li>
</ul>
</body>
</html>
